from math import sqrt

print('-----------Программа №7(7)-----------')
V = int(input("Выберите способ ввода параметров:\n1 - подсчет площади с помощью длин сторон\n2 - метод координат: "))

if V == 1:
    a = int(input('Введите первую сторону треугольника: '))
    b = int(input('Введите вторую сторону треугольника: '))
    c = int(input('Введите третью сторону треугольника: '))
    if (a < b + c) and (b < a + c) and (c < a + b):
        P = (a + b + c) / 2
        S = sqrt(P * (P - a) * (P - b) * (P - c))
        print('Площадь треугольника равна: ', S)
    else:
        print('Такого треугольника не существует!')
elif V == 2:
    x1 = int(input('Введите координату x1: '))
    y1 = int(input('Введите координату y1: '))
    x2 = int(input('Введите координату x2: '))
    y2 = int(input('Введите координату y2: '))
    x3 = int(input('Введите координату x3: '))
    y3 = int(input('Введите координату y3: '))
    a = sqrt(((x2 - x1) * (x2 - x1)) + ((y2 - y1) * (y2 - y1)))
    b = sqrt(((x3 - x2) * (x3 - x2)) + ((y3 - y2) * (y3 - y2)))
    c = sqrt(((x3 - x1) * (x3 - x1)) + ((y3 - y1) * (y3 - y1)))
    if (a < b + c) & (b < a + c) & (c < a + b):
        P = (a + b + c) / 2
        S = sqrt(P * (P - a) * (P - b) * (P - c))
        print('Площадь треугольника равна: ', S)
    else:
        print('Такого треугольника не существует!')
else:
    print('Вы ввели некорректное число!')
